### Terraform `plan` Succeeded for Workspace: `dev`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_secretsmanager_secret.argocd will be created
+   resource "aws_secretsmanager_secret" "argocd" {
+       arn                            = (known after apply)
+       force_overwrite_replica_secret = false
+       id                             = (known after apply)
+       name                           = "argocd"
+       name_prefix                    = (known after apply)
+       policy                         = (known after apply)
+       recovery_window_in_days        = 0
+       rotation_enabled               = (known after apply)
+       rotation_lambda_arn            = (known after apply)
+       tags_all                       = (known after apply)
    }

  # aws_secretsmanager_secret_version.argocd will be created
+   resource "aws_secretsmanager_secret_version" "argocd" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       secret_id      = (known after apply)
+       secret_string  = (sensitive value)
+       version_id     = (known after apply)
+       version_stages = (known after apply)
    }

  # bcrypt_hash.argo will be created
+   resource "bcrypt_hash" "argo" {
+       cleartext = (sensitive value)
+       cost      = 10
+       id        = (known after apply)
    }

  # random_password.argocd will be created
+   resource "random_password" "argocd" {
+       bcrypt_hash      = (sensitive value)
+       id               = (known after apply)
+       length           = 16
+       lower            = true
+       min_lower        = 0
+       min_numeric      = 0
+       min_special      = 0
+       min_upper        = 0
+       number           = true
+       numeric          = true
+       override_special = "!#$%&*()-_=+[]{}<>:?"
+       result           = (sensitive value)
+       special          = true
+       upper            = true
    }

  # module.kubernetes_addons.data.aws_eks_cluster.eks_cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "eks_cluster" {
+       arn                       = (known after apply)
+       certificate_authority     = (known after apply)
+       cluster_id                = (known after apply)
+       created_at                = (known after apply)
+       enabled_cluster_log_types = (known after apply)
+       endpoint                  = (known after apply)
+       id                        = (known after apply)
+       identity                  = (known after apply)
+       kubernetes_network_config = (known after apply)
+       name                      = "jingood2-dev-eks"
+       outpost_config            = (known after apply)
+       platform_version          = (known after apply)
+       role_arn                  = (known after apply)
+       status                    = (known after apply)
+       tags                      = (known after apply)
+       version                   = (known after apply)
+       vpc_config                = (known after apply)
    }

  # module.kubernetes_addons.time_sleep.dataplane will be created
+   resource "time_sleep" "dataplane" {
+       create_duration = "10s"
+       id              = (known after apply)
+       triggers        = {
+           "data_plane_wait_arn" = ""
+           "eks_cluster_id"      = "jingood2-dev-eks"
        }
    }

  # module.kubernetes_addons.module.argocd[0].kubernetes_namespace_v1.this[0] will be created
+   resource "kubernetes_namespace_v1" "this" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           name             = "argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # module.kubernetes_addons.module.aws_ebs_csi_driver[0].aws_eks_addon.aws_ebs_csi_driver[0] will be created
+   resource "aws_eks_addon" "aws_ebs_csi_driver" {
+       addon_name               = "aws-ebs-csi-driver"
+       addon_version            = "v1.17.0-eksbuild.1"
+       arn                      = (known after apply)
+       cluster_name             = (known after apply)
+       configuration_values     = (known after apply)
+       created_at               = (known after apply)
+       id                       = (known after apply)
+       modified_at              = (known after apply)
+       preserve                 = true
+       resolve_conflicts        = "OVERWRITE"
+       service_account_role_arn = (known after apply)
+       tags_all                 = (known after apply)
    }

  # module.kubernetes_addons.module.aws_ebs_csi_driver[0].aws_iam_policy.aws_ebs_csi_driver[0] will be created
+   resource "aws_iam_policy" "aws_ebs_csi_driver" {
+       arn         = (known after apply)
+       description = "IAM Policy for AWS EBS CSI Driver"
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "ec2:ModifyVolume",
+                           "ec2:DetachVolume",
+                           "ec2:DescribeVolumesModifications",
+                           "ec2:DescribeVolumes",
+                           "ec2:DescribeTags",
+                           "ec2:DescribeSnapshots",
+                           "ec2:DescribeInstances",
+                           "ec2:DescribeAvailabilityZones",
+                           "ec2:CreateSnapshot",
+                           "ec2:AttachVolume",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = ""
                    },
+                   {
+                       Action    = "ec2:CreateTags"
+                       Condition = {
+                           StringEquals = {
+                               "ec2:CreateAction" = [
+                                   "CreateVolume",
+                                   "CreateSnapshot",
                                ]
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = [
+                           "arn:aws:ec2:*:*:volume/*",
+                           "arn:aws:ec2:*:*:snapshot/*",
                        ]
+                       Sid       = ""
                    },
+                   {
+                       Action   = "ec2:DeleteTags"
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:ec2:*:*:volume/*",
+                           "arn:aws:ec2:*:*:snapshot/*",
                        ]
+                       Sid      = ""
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/CSIVolumeName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:CreateVolume"
+                       Condition = {
+                           StringLike = {
+                               "aws:RequestTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/CSIVolumeName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:DeleteVolume"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/kubernetes.io/cluster/*" = "owned"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:DeleteSnapshot"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/CSIVolumeSnapshotName" = "*"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
+                   {
+                       Action    = "ec2:DeleteSnapshot"
+                       Condition = {
+                           StringLike = {
+                               "ec2:ResourceTag/ebs.csi.aws.com/cluster" = "true"
                            }
                        }
+                       Effect    = "Allow"
+                       Resource  = "*"
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # module.kubernetes_addons.module.cluster_autoscaler[0].data.aws_iam_policy_document.cluster_autoscaler will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cluster_autoscaler" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "autoscaling:DescribeAutoScalingGroups",
+               "autoscaling:DescribeAutoScalingInstances",
+               "autoscaling:DescribeLaunchConfigurations",
+               "autoscaling:DescribeTags",
+               "ec2:DescribeInstanceTypes",
+               "ec2:DescribeLaunchTemplateVersions",
            ]
+           effect    = "Allow"
+           resources = [
+               "*",
            ]
        }
+       statement {
+           actions   = [
+               "ec2:DescribeInstanceTypes",
            ]
+           effect    = "Allow"
+           resources = [
+               "*",
            ]

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "owned",
                ]
+               variable = (known after apply)
            }
        }
+       statement {
+           actions   = [
+               "autoscaling:SetDesiredCapacity",
+               "autoscaling:TerminateInstanceInAutoScalingGroup",
            ]
+           effect    = "Allow"
+           resources = [
+               "arn:aws:autoscaling:us-east-1:484752921218:autoScalingGroup:*",
            ]

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "owned",
                ]
+               variable = (known after apply)
            }
        }
+       statement {
+           actions   = [
+               "eks:DescribeNodegroup",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
            ]

+           condition {
+               test     = "StringEquals"
+               values   = [
+                   "owned",
                ]
+               variable = (known after apply)
            }
        }
    }

  # module.kubernetes_addons.module.cluster_autoscaler[0].aws_iam_policy.cluster_autoscaler will be created
+   resource "aws_iam_policy" "cluster_autoscaler" {
+       arn         = (known after apply)
+       description = "Cluster Autoscaler IAM policy"
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = (known after apply)
+       path        = "/"
+       policy      = (known after apply)
+       policy_id   = (known after apply)
+       tags_all    = (known after apply)
    }

  # module.kubernetes_addons.module.argocd[0].module.helm_addon.helm_release.addon[0] will be created
+   resource "helm_release" "addon" {
+       atomic                     = false
+       chart                      = "argo-cd"
+       cleanup_on_fail            = false
+       create_namespace           = true
+       dependency_update          = false
+       description                = "The ArgoCD Helm Chart deployment configuration"
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "argo-cd"
+       namespace                  = "argocd"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://argoproj.github.io/argo-helm"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 1200
+       values                     = [
+           <<-EOT
                redis-ha:
                  enabled: true
                
                controller:
                  enableStatefulSet: true
                
                server:
                  autoscaling:
                    enabled: true
                    minReplicas: 2
                
                repoServer:
                  autoscaling:
                    enabled: true
                    minReplicas: 2
                
                configs:
                  cm:
                    #use annotation for tracking but keep labels for compatibility with other tools
                    application.resourceTrackingMethod: annotation+label
            EOT,
        ]
+       verify                     = false
+       version                    = "5.13.8"
+       wait                       = false
+       wait_for_jobs              = false

+       postrender {}
    }

  # module.kubernetes_addons.module.aws_ebs_csi_driver[0].module.irsa_addon[0].aws_iam_role.irsa[0] will be created
+   resource "aws_iam_role" "irsa" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringLike = {
+                               "oidc.eks.us-east-1.amazonaws.com/id/F541D751635A18B6719DF08E4E19A107:aud" = "sts.amazonaws.com"
+                               "oidc.eks.us-east-1.amazonaws.com/id/F541D751635A18B6719DF08E4E19A107:sub" = "system:serviceaccount:kube-system:ebs-csi-controller-sa"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::484752921218:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/F541D751635A18B6719DF08E4E19A107"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       description           = "AWS IAM Role for the Kubernetes service account ebs-csi-controller-sa."
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)
    }

  # module.kubernetes_addons.module.aws_ebs_csi_driver[0].module.irsa_addon[0].aws_iam_role_policy_attachment.irsa[0] will be created
+   resource "aws_iam_role_policy_attachment" "irsa" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = (known after apply)
    }

  # module.kubernetes_addons.module.cluster_autoscaler[0].module.helm_addon.helm_release.addon[0] will be created
+   resource "helm_release" "addon" {
+       atomic                     = false
+       chart                      = "cluster-autoscaler"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       description                = "Cluster AutoScaler helm Chart deployment configuration."
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "cluster-autoscaler"
+       namespace                  = "kube-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://kubernetes.github.io/autoscaler"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 1200
+       values                     = (known after apply)
+       verify                     = false
+       version                    = "9.21.0"
+       wait                       = true
+       wait_for_jobs              = false

+       postrender {}

+       set {
+           name  = "rbac.serviceAccount.create"
+           value = "false"
        }
+       set {
+           name  = "rbac.serviceAccount.name"
+           value = "cluster-autoscaler-sa"
        }
    }

  # module.kubernetes_addons.module.metrics_server[0].module.helm_addon.helm_release.addon[0] will be created
+   resource "helm_release" "addon" {
+       atomic                     = false
+       chart                      = "metrics-server"
+       cleanup_on_fail            = false
+       create_namespace           = false
+       dependency_update          = false
+       description                = "Metric server helm Chart deployment configuration"
+       disable_crd_hooks          = false
+       disable_openapi_validation = false
+       disable_webhooks           = false
+       force_update               = false
+       id                         = (known after apply)
+       lint                       = false
+       manifest                   = (known after apply)
+       max_history                = 0
+       metadata                   = (known after apply)
+       name                       = "metrics-server"
+       namespace                  = "kube-system"
+       pass_credentials           = false
+       recreate_pods              = false
+       render_subchart_notes      = true
+       replace                    = false
+       repository                 = "https://kubernetes-sigs.github.io/metrics-server/"
+       reset_values               = false
+       reuse_values               = false
+       skip_crds                  = false
+       status                     = "deployed"
+       timeout                    = 1200
+       verify                     = false
+       version                    = "3.8.2"
+       wait                       = true
+       wait_for_jobs              = false

+       postrender {}
    }

  # module.kubernetes_addons.module.cluster_autoscaler[0].module.helm_addon.module.irsa[0].aws_iam_role.irsa[0] will be created
+   resource "aws_iam_role" "irsa" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRoleWithWebIdentity"
+                       Condition = {
+                           StringLike = {
+                               "oidc.eks.us-east-1.amazonaws.com/id/F541D751635A18B6719DF08E4E19A107:aud" = "sts.amazonaws.com"
+                               "oidc.eks.us-east-1.amazonaws.com/id/F541D751635A18B6719DF08E4E19A107:sub" = "system:serviceaccount:kube-system:cluster-autoscaler-sa"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Federated = "arn:aws:iam::484752921218:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/F541D751635A18B6719DF08E4E19A107"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       description           = "AWS IAM Role for the Kubernetes service account cluster-autoscaler-sa."
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)
    }

  # module.kubernetes_addons.module.cluster_autoscaler[0].module.helm_addon.module.irsa[0].aws_iam_role_policy_attachment.irsa[0] will be created
+   resource "aws_iam_role_policy_attachment" "irsa" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = (known after apply)
    }

  # module.kubernetes_addons.module.cluster_autoscaler[0].module.helm_addon.module.irsa[0].kubernetes_service_account_v1.irsa[0] will be created
+   resource "kubernetes_service_account_v1" "irsa" {
+       automount_service_account_token = true
+       default_secret_name             = (known after apply)
+       id                              = (known after apply)

+       metadata {
+           annotations      = (known after apply)
+           generation       = (known after apply)
+           name             = "cluster-autoscaler-sa"
+           namespace        = "kube-system"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

Plan: 17 to add, 0 to change, 0 to destroy.
```
</details>